Make a list of odd numbers up to 50

In [2]:
odds = list(range(1,50,2))
odds_two = [i for i in range(1,50) if i % 2 != 0]
print(odds_two)

[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49]

In [5]:
evens = list(range(0,51,2))
evens_two = [i for i in range(1,50) if i % 2 == 0]
print(evens_two)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50]

In [5]:
My_list = list(range(251))

def first_digit(
    num):
    position = len(str(num))-1
    return num // 10**position % 10

First_digit_two = []

for i in range(len(My_list)):
    if (first_digit(My_list[i]) == 2):
        First_digit_two.append(My_list[i])
    i += 1
    
print(First_digit_two)

[2, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250]

In [3]:
[i for i in range(250) if str(i)[0] == "2"]

[2,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 200,
 201,
 202,
 203,
 204,
 205,
 206,
 207,
 208,
 209,
 210,
 211,
 212,
 213,
 214,
 215,
 216,
 217,
 218,
 219,
 220,
 221,
 222,
 223,
 224,
 225,
 226,
 227,
 228,
 229,
 230,
 231,
 232,
 233,
 234,
 235,
 236,
 237,
 238,
 239,
 240,
 241,
 242,
 243,
 244,
 245,
 246,
 247,
 248,
 249]

In [4]:
My_list= list(range(4,16))
def square(list):
    return [i ** 2 for i in list]

New_list = square(My_list)
print(New_list)

[16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225]

In [10]:
summary = 0
for i in range(1,100001):
    summary += ((-1)**i)/i
    i += 1
print(summary)

-0.6931421805849816

In [12]:
My_string = "xxx.jpg"
New_string = My_string.replace("jpg", "png")
print(New_string)

xxx.png

In [11]:
string_ = "asdasjkla.asdjasmdn.ěí+euá+í."
print(string_.split("."))

['asdasjkla', 'asdjasmdn', 'ěí+euá+í', '']

In [3]:
string = "a/b/c/d.png?bla=haha"
substring = string.split("/")
string.split("?")
print(string)

['a', 'b', 'c', 'd.png?bla=haha']
a/b/c/d.png?bla=haha

In [15]:
print([i for i in range(1,100) if (i+1) %3 != 0 ])

[1, 3, 4, 6, 7, 9, 10, 12, 13, 15, 16, 18, 19, 21, 22, 24, 25, 27, 28, 30, 31, 33, 34, 36, 37, 39, 40, 42, 43, 45, 46, 48, 49, 51, 52, 54, 55, 57, 58, 60, 61, 63, 64, 66, 67, 69, 70, 72, 73, 75, 76, 78, 79, 81, 82, 84, 85, 87, 88, 90, 91, 93, 94, 96, 97, 99]

In [8]:
New_dict = {}
abc = "abc"
for i in range(1,51):
    string_i= str(i)
    Enum_abc = abc + string_i
    New_dict[i] = Enum_abc
    i+=1
print(New_dict)

{1: 'abc1', 2: 'abc2', 3: 'abc3', 4: 'abc4', 5: 'abc5', 6: 'abc6', 7: 'abc7', 8: 'abc8', 9: 'abc9', 10: 'abc10', 11: 'abc11', 12: 'abc12', 13: 'abc13', 14: 'abc14', 15: 'abc15', 16: 'abc16', 17: 'abc17', 18: 'abc18', 19: 'abc19', 20: 'abc20', 21: 'abc21', 22: 'abc22', 23: 'abc23', 24: 'abc24', 25: 'abc25', 26: 'abc26', 27: 'abc27', 28: 'abc28', 29: 'abc29', 30: 'abc30', 31: 'abc31', 32: 'abc32', 33: 'abc33', 34: 'abc34', 35: 'abc35', 36: 'abc36', 37: 'abc37', 38: 'abc38', 39: 'abc39', 40: 'abc40', 41: 'abc41', 42: 'abc42', 43: 'abc43', 44: 'abc44', 45: 'abc45', 46: 'abc46', 47: 'abc47', 48: 'abc48', 49: 'abc49', 50: 'abc50'}

In [19]:
new_dict = {i: f"abc{i}" for i in range(1,51) }

In [23]:
task7_dict = {v: k for k, v in new_dict.items()} #.items vytvoří tuple s (key,value)
print(task7_dict)

{'abc1': 1, 'abc2': 2, 'abc3': 3, 'abc4': 4, 'abc5': 5, 'abc6': 6, 'abc7': 7, 'abc8': 8, 'abc9': 9, 'abc10': 10, 'abc11': 11, 'abc12': 12, 'abc13': 13, 'abc14': 14, 'abc15': 15, 'abc16': 16, 'abc17': 17, 'abc18': 18, 'abc19': 19, 'abc20': 20, 'abc21': 21, 'abc22': 22, 'abc23': 23, 'abc24': 24, 'abc25': 25, 'abc26': 26, 'abc27': 27, 'abc28': 28, 'abc29': 29, 'abc30': 30, 'abc31': 31, 'abc32': 32, 'abc33': 33, 'abc34': 34, 'abc35': 35, 'abc36': 36, 'abc37': 37, 'abc38': 38, 'abc39': 39, 'abc40': 40, 'abc41': 41, 'abc42': 42, 'abc43': 43, 'abc44': 44, 'abc45': 45, 'abc46': 46, 'abc47': 47, 'abc48': 48, 'abc49': 49, 'abc50': 50}

In [24]:
import pandas as pd
import csv
df = pd.read_csv("en.txt",delimiter = " ",header=None)

In [32]:
df.rename(columns=({0:"word", 1:"count"}), inplace= True )

In [27]:
df

                  0        1
0               you  4621939
1               the  3957465
2                 i  3476773
3                to  2873389
4                 a  2551033
...             ...      ...
450808        mekin        1
450809      galaway        1
450810    chrothane        1
450811  theydropped        1
450812    it'sgreat        1

[450813 rows x 2 columns]

In [29]:
len(df)

450813

In [34]:
df.word = df.word.astype(str) #přetypuje vše na string

In [35]:
i=0
for row in df.word:
    string = row
    if "'" in string:
        i+=1
print(i)

52175

In [37]:
df[df.word.apply(lambda x : "'" in x)]

              word   count
22           don't  764177
25             i'm  741643
29            it's  688371
47          you're  429615
54          that's  365560
...            ...     ...
450799      seol's       1
450801  ch'entrate       1
450803    naveed's       1
450806   rebuild's       1
450812   it'sgreat       1

[52175 rows x 2 columns]

In [40]:
import re
i = 0
for row in df.word:
    string = row
    match = re.search("'",string)
    if match:
        i += 1
print(i)

52175

In [45]:
df.sort_values( by = "count" )

              word    count
0              you  4621939
1              the  3957465
2                i  3476773
3               to  2873389
4                a  2551033
...            ...      ...
315587   etancelin        1
315588  cheongsams        1
315589   androdyne        1
315590      triode        1
450812   it'sgreat        1

[450813 rows x 2 columns]